<a href="https://colab.research.google.com/github/lakshmi1444/teju_practice/blob/master/WhetherPrediction.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [0]:
data_set = pd.read_csv("/content/datasets_20710_26737_Bengaluru_House_Data.csv")

In [3]:
data_set.head(5)

              area_type   availability  ... balcony   price
0  Super built-up  Area         19-Dec  ...     1.0   39.07
1            Plot  Area  Ready To Move  ...     3.0  120.00
2        Built-up  Area  Ready To Move  ...     3.0   62.00
3  Super built-up  Area  Ready To Move  ...     1.0   95.00
4  Super built-up  Area  Ready To Move  ...     1.0   51.00

[5 rows x 9 columns]

In [4]:
len(data_set.columns)

9

In [5]:
data_set.columns

Index(['area_type', 'availability', 'location', 'size', 'society',
       'total_sqft', 'bath', 'balcony', 'price'],
      dtype='object')

In [6]:
data_set.dtypes

area_type        object
availability     object
location         object
size             object
society          object
total_sqft       object
bath            float64
balcony         float64
price           float64
dtype: object

In [7]:
data_set.describe()

               bath       balcony         price
count  13247.000000  12711.000000  13320.000000
mean       2.692610      1.584376    112.565627
std        1.341458      0.817263    148.971674
min        1.000000      0.000000      8.000000
25%        2.000000      1.000000     50.000000
50%        2.000000      2.000000     72.000000
75%        3.000000      2.000000    120.000000
max       40.000000      3.000000   3600.000000

In [8]:
data_set.shape

(13320, 9)

In [9]:
data_set.area_type.unique()

array(['Super built-up  Area', 'Plot  Area', 'Built-up  Area',
       'Carpet  Area'], dtype=object)

In [10]:
data_set.groupby(["area_type"])["area_type"].count()

area_type
Built-up  Area          2418
Carpet  Area              87
Plot  Area              2025
Super built-up  Area    8790
Name: area_type, dtype: int64

In [0]:
df2 = data_set.drop(["area_type","society","availability"],axis =1)

In [12]:
df2.head()

                   location       size total_sqft  bath  balcony   price
0  Electronic City Phase II      2 BHK       1056   2.0      1.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0      3.0  120.00
2               Uttarahalli      3 BHK       1440   2.0      3.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0      1.0   95.00
4                  Kothanur      2 BHK       1200   2.0      1.0   51.00

In [13]:
df2.isnull().sum()

location        1
size           16
total_sqft      0
bath           73
balcony       609
price           0
dtype: int64

In [14]:
df3 = df2.dropna()
df3.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
balcony       0
price         0
dtype: int64

In [15]:
df3["size"].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '3 Bedroom', '1 BHK', '1 RK',
       '4 BHK', '1 Bedroom', '2 Bedroom', '6 Bedroom', '8 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '11 Bedroom', '43 Bedroom',
       '14 BHK', '8 BHK', '12 Bedroom', '10 Bedroom', '13 BHK'],
      dtype=object)

In [16]:
df3["bhk"] = df3["size"].apply(lambda x :int (x.split(" ")[0]))

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [17]:
df3.head()

                   location       size total_sqft  bath  balcony   price  bhk
0  Electronic City Phase II      2 BHK       1056   2.0      1.0   39.07    2
1          Chikka Tirupathi  4 Bedroom       2600   5.0      3.0  120.00    4
2               Uttarahalli      3 BHK       1440   2.0      3.0   62.00    3
3        Lingadheeranahalli      3 BHK       1521   3.0      1.0   95.00    3
4                  Kothanur      2 BHK       1200   2.0      1.0   51.00    2

In [18]:
df3["bhk"].unique()

array([ 2,  4,  3,  1,  6,  8,  7,  5, 11,  9, 27, 43, 14, 12, 10, 13])

In [19]:
df3["total_sqft"].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [20]:
isinstance("1056", float)

False

In [21]:
df3[~df3['total_sqft'].apply(lambda x :isinstance(x, float))].head(10)

                    location       size total_sqft  bath  balcony   price  bhk
0   Electronic City Phase II      2 BHK       1056   2.0      1.0   39.07    2
1           Chikka Tirupathi  4 Bedroom       2600   5.0      3.0  120.00    4
2                Uttarahalli      3 BHK       1440   2.0      3.0   62.00    3
3         Lingadheeranahalli      3 BHK       1521   3.0      1.0   95.00    3
4                   Kothanur      2 BHK       1200   2.0      1.0   51.00    2
5                 Whitefield      2 BHK       1170   2.0      1.0   38.00    2
8               Marathahalli      3 BHK       1310   3.0      1.0   63.25    3
10                Whitefield      3 BHK       1800   2.0      2.0   70.00    3
11                Whitefield  4 Bedroom       2785   5.0      3.0  295.00    4
12        7th Phase JP Nagar      2 BHK       1000   2.0      1.0   38.00    2

In [0]:
def check_float(x):
  try:
    x = float(x)
    
  except:
    
    return False
  return True

In [23]:
df3[ ~df3["total_sqft"].apply(check_float)]["total_sqft"]

30       2100 - 2850
122      3067 - 8156
137      1042 - 1105
165      1145 - 1340
188      1015 - 1540
            ...
12975     850 - 1060
12990    1804 - 2273
13059    1200 - 1470
13265    1133 - 1384
13299    2830 - 2882
Name: total_sqft, Length: 186, dtype: object

In [0]:
def average_sqft(x):
  if x.split("-"):
      nums = x.split("-")
      
      if len(nums)==2:
        return (float(nums[0])+float(nums[1]))/2
    
  try:
      return float(x)
  except :
    print(x)
    return None

In [25]:
df4 = df3.copy()
df4.total_sqft = df4.total_sqft.apply(average_sqft)
df4 =df4[df4.total_sqft.notnull()]
df4.head()

34.46Sq. Meter
1000Sq. Meter
5.31Acres
30Acres
716Sq. Meter
1500Sq. Meter
142.61Sq. Meter
1574Sq. Yards
117Sq. Yards
3040Sq. Meter
500Sq. Yards
167Sq. Meter
3Cents
188.89Sq. Yards
204Sq. Meter
45Sq. Yards
133.3Sq. Yards
78.03Sq. Meter
122Sq. Yards
84.53Sq. Meter
2.09Acres
24Guntha
697Sq. Meter
142.61Sq. Meter
1500Cents
132Sq. Yards
2Acres
1100Sq. Meter
15Acres
1.26Acres
151.11Sq. Yards
1Grounds
2940Sq. Yards
45.06Sq. Meter
1.25Acres
86.72Sq. Meter
38Guntha
6Acres
120Sq. Yards
24Sq. Meter
142.84Sq. Meter
300Sq. Yards

                   location       size  total_sqft  bath  balcony   price  bhk
0  Electronic City Phase II      2 BHK      1056.0   2.0      1.0   39.07    2
1          Chikka Tirupathi  4 Bedroom      2600.0   5.0      3.0  120.00    4
2               Uttarahalli      3 BHK      1440.0   2.0      3.0   62.00    3
3        Lingadheeranahalli      3 BHK      1521.0   3.0      1.0   95.00    3
4                  Kothanur      2 BHK      1200.0   2.0      1.0   51.00    2

In [0]:
df5 =df4.copy()

In [0]:
df5["per_sq_feet"] = df5["price"]*100000/df5["total_sqft"]

In [28]:
df5.head(2)

                   location       size  total_sqft  ...   price  bhk  per_sq_feet
0  Electronic City Phase II      2 BHK      1056.0  ...   39.07    2  3699.810606
1          Chikka Tirupathi  4 Bedroom      2600.0  ...  120.00    4  4615.384615

[2 rows x 8 columns]

In [29]:
df5.location.unique()

array(['Electronic City Phase II', 'Chikka Tirupathi', 'Uttarahalli', ...,
       '12th cross srinivas nagar banshankari 3rd stage',
       'Havanur extension', 'Abshot Layout'], dtype=object)

In [30]:
df5.location.nunique()

1259

In [0]:
location_stats=df5.groupby("location")["location"].count().sort_values(ascending = False)

In [38]:
location_stats

location
Whitefield                 513
Sarjapur  Road             372
Electronic City            300
Kanakpura Road             259
Thanisandra                230
                          ...
Kenchanehalli R R Nagar      1
Keerthi Layout               1
Kathriguppe IV Phase         1
Karnataka Shabarimala        1
 Anekal                      1
Name: location, Length: 1259, dtype: int64

In [43]:
len(location_stats)

1259

In [0]:
location_stats_lessthan10=location_stats[location_stats<10]

In [0]:
df5.location =df5.location.apply(lambda x: "other" if x in location_stats_lessthan10 else x)

In [48]:
df5.location.nunique()

248